#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "6431882f64af7621924d79926a051d26" -> "faa150a9e21eaf345a535de1708a266f"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "eba17bedaa876461815aff38af9cdf3c" -> "b7a56ae04a3bba103913cba643e9ae04"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "a25acb5d65e31105d60012e14d12a4a2" -> "ace85f1c0314895b04d2ef8b1f02d301"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "36d8061e19e395c08720276b0ce4f518" -> "2830024cdf7de133d8768f16df703b48"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "f120c4c4f8483aec4a578918c374231b" -> "adfb7859731b85503868073d7e72655e"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "4a2d5d94346f0b36f8869c074653ced8" -> "0bbe92b2535f4e2d82aa478d7a326e53"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "f05134f92c4071046f3f2a809229d4bc" -> "84c6118aed093d5942e3244afb8bc685"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "c24dcb33ed514b9396a02b97e1ba13a7" -> "41475382085807e9e66af26714e4c88f"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "1dacb7da3c874aa48b9ab44ec2b167ad" -> "fa947e83155336024cad9608b0445b3b"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "9f0446809da4714c2528381258c0de4b" -> "87f70a7f7e3774b9303a99f31bcd8a13"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "e31a8a84134b9be1e82b4a8fee8b7f2c" -> "7dd64b93b3d4d93347ea3d97c523ee45"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "97968caee05cbea390b63b2fbb747ba3" -> "699ff5f1890fd2bd9ff3a3c072070a55"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "2b9bcde09a7d832731c933d0e26b3ef2" -> "596d3082f4134af1b92575cc61da9bf1"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "fc92b076d2fa93951b37a16b9e93175b" -> "be4eb7f94697dedab695b45eb8debc6c"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "804692e7011b8e3a2f1bef62d635a3eb" -> "c99a9322704f9746995fadcbb9e9853d"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "f82acf9b749d39dc20d262de1ad930c3" -> "e165be3a078b2c4d2260cc9077d90dd3"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "928486a82ba0384126939b8604ccf97a" -> "c70409e383eace457a00d1d06981cc4a"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "ee550829385a3794e2b5fa42955d56d2" -> "24ae826d1e15b37e48baa3c075332b39"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "e4ac811c9717bea79b0bf1dc8e881c94" -> "89280af43b0fadb9b8d4bbeb3f6c1a38"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "f800188ad1752f141eb80c84b9cb4d1b" -> "d55a1a0c743312b3a730474d9ff8270f"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "8a5f2bf25a66da5e6373788ccf6e448d" -> "154adcff0ea4d0fed81395787c8e3363"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "d4063c29a163810510582878b3a7df8e" -> "2cb940a402b0119a2110f53f267b06d5"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "4dfda2672beefc45f88eef6f5e2bfc48" -> "0811b2bc5dd5eb68690a55e8a07d7a35"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "8e71cb4b89a60ba375c377858fdc5290" -> "5cbc7c689b26c7934cba9d14056e5a6e"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "dcb14723b5fc484199d1c1ad2d9dc36d" -> "13025ee07e013333f2ff2697bfa80435"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "075c77b086e95d2d6271c49e674d9dc8" -> "9ed842c42bcb5f8fcb02f9937ac6d925"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "50cf14fa75e3fcb2721d2950c0890d86" -> "58978a8572eaee2af026e737872efd14"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag               = "be0d051318471aa157c612afaa90b1c7" -> "8ef676d2c40e19a46dd1709bda0590ca"
        id                 = "lambdas/demo/get_full_year_total_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "7679aa337cf924d1430a28eaf5d9be50" -> "43c0d2453fddde1f35464745f7d50372"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "a49351fe18204f308ad1cc274697fe17" -> "187cfab25d6c720fec7a462f5bca2f47"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "48cbd1f4e3599b59413b07e41225121f" -> "f8e82f7532c57172b216c20b5e5bf0cb"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "decfe4b2de9307351ea672f44bee7f7c" -> "ffe93d48b568e568f3c7e46bfdd77b69"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "a924036a35814b94418327f238f28b93" -> "f40b9576e0ff059cbad848cf8c242cc7"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "26b6d7290f0f1e278d39df54342c4e5a" -> "e07b97c129a7425c1f01fe3ce029e37a"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "f0370ac7fcbb2cc38041165dd33e1687" -> "99595927d2d0ef0e50b67feb278c5cac"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "2be272c8219dc697fb532f251f19d6ec" -> "505d52bbe19ea41f0fa67215ee17960d"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "1a46fe34158cb52a15cdc452647b8a84" -> "5d7941335182f9d37554556ede9117b2"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "f1d3b644ee738245a8ba9a6fe209769c" -> "35893902f2ef79ef86292fcb78616aca"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "0410ad73d579cb00b94b74367ce47833" -> "4f09efb740d0bc0227d28bdee59b0712"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "d9b95dc935c62aae2ed3361643c84c99" -> "72a42d88603c97026cafe87ebf97ad33"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "ee9759247f5f0e8559af2c7948c39794" -> "f213f254a060260e34059f3a34c5ae51"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "ed8a0b28139d35ba6424496d49e89f0e" -> "f8c183fc3cce84b5c9b169ef7eec55bc"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "2a05f33a9cbadd3905e6654aafd54170" -> "3a537eff88546de525da6567d2c7fa77"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "2495b8fd4e5474f876a4a52f558ca46f" -> "6448a74daacbd37e794d9fae5282cbe3"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "b97184d92065edf710bffb88f02df6fd" -> "6a629224e6254c36012b00cb826da6fd"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "7737e7c7f175e50ac7fbd38620c1784c" -> "720b1125150f9beee9f2c80415df04bb"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.codebuild.aws_codebuild_source_credential.git_credential must be replaced
-/+ resource "aws_codebuild_source_credential" "git_credential" {
      ~ arn         = "arn:aws:codebuild:us-west-2:435552912911:token/github" -> (known after apply)
      ~ id          = "arn:aws:codebuild:us-west-2:435552912911:token/github" -> (known after apply)
      ~ token       = (sensitive value) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "rDqb33ozX0a/Sw6hcIoDrCTXzc5payp5Atpv2KXyZMQ=" -> "HfSJaiiTxFzFFpjCobAY7KYaGBpCvo58koScyP+phfY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "mbAWEGWXPK1Qzbl9MBClG8f9IuLMU5MXBaFBxVV9qx8=" -> "rfjLIINDcWGzqr8vLe5wGJCMlBemc6I18XGDmN6eYf4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "xwaIAUlpzlUHvV3VI2Smy9HQYSe/fXnVNxRzjvBkS4Q=" -> "TIMZ8feTD54Anx1qMfVnoucs0mJC8Kfi8PLNBxCRlz4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "INKhUfDYNqVQAAhOBqCBNED0hpKWScsamuKzMH7Nd/Q=" -> "/Z9KGahD2yh0W6OHT6Y7KxeBCLi8XGHhtcVInIgS0P4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "afctkexUfsgHYiDaWJDsC3KE978+36qaOTYp5NI4vyI=" -> "Yo0Kio2OfAFxsoj0f5n+umbnbqTFNmlAZbIR297Pipk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "1kn+whYSweQQ9j9cZiGtG4EjX0qqmfIqnDcsZZ6KSrw=" -> "VlNgrU4C5TfX5X8uflH/bkjuiN7sxU/yb34Nf/zjj5o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "vIxf+oxAmgpVcbH16yvUN0K59zRnlnAiWYQVP+Uj0IY=" -> "orD9bmRyBaqT7J0J58Xm2f+j8aCwMN6BpN6LvW0gIoo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "TmjynSuJ0e5z1RPqiA5dxKzmSmaB2CWWpcTphI4R87Y=" -> "f/XGh7gFNWG3/z5VSpjluPzv99ExXMb+i3vD20SEzwE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "dRhMhzMniHq3kH4bXJj17s+lq1OImy/fYcfJCol50WA=" -> "AnT4fxtjy2OOdYHLZIYgMrqsb/RGh91/zLOL7QxmT3I="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "EqLDsYq6AZT44NZKMdgB6u9+ShiTDSYxbasBowVzO3Q=" -> "7eSBzdx8tzet9ZIwkykkTXQhOl0vSBUhZgQAkJPCe1E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "ag+xYDGqm2uyUz7JBj31hSYBHu7MEda07lgV/HXZwJs=" -> "0Xf8cI03x5ESqyWKH61rdSMaXyHUQFFdXurpKePQT0w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "X0pPP9d1LHtaf5uTbfvv4Xc0oRU3tqQJzPjuP5ucuTk=" -> "6BXLz9/LsFqQ2zWbq9NeEksQWvJ1WtYtYluHFGUmjec="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZrZLB2tv1SQirIarirzWbZPulRQ9195aSWhnV0vKZTk=" -> "ZgM8yXssCZmX17VUMmhbqBusJspAm9Dnl9hgK4h4IWo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "DBG3FKZeKOJNdotKGhMhLRIgEOSSebrIN9AKZ6WbFO0=" -> "+vy/Q3HMFxH07TtLP8yIwuDJWI0L4XgaeoobY0TJ2Xo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "AIuZ3GlgbUGQOZZwHFYmLIPRS1QnVNdnSbjFPkOs5zU=" -> "/jyKVpX0+SxMLZXEwwT5rbDxg6iQ8d15g3Vx4B2qK2o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "S+okPOHrzOngmtnSwIoYeBKG84t7hyDroAi/80vIgeg=" -> "t437gnJxbE+hrHjnHXvgwhHO9+IBGllIF97mkzrhwx8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "5oMZcVJyOyOD2zoQmcoJYb41M8yYJUiWLBBA6pV4afg=" -> "P4boMq9kf4h37V8MvC8nrkQIJFlWRXixvDDGVLH6m8c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "/A6L2fMHKv7z23dMdVyXsaBAahkTj5l3QGrkpY9/jJs=" -> "bzsmPeOY625CT8++OY4qZogtlVSkFmM9Uq5vYrK9l20="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "lDHvcQKKxxGCD500FwItTiT67IoGUCE6VcmT1ozVomE=" -> "l3Y8sXOtlZKQpjEZoN0ZdLqDPQvNlJKSO5A7exWh2RA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "392AfyCbuTJxG298SnNnt2UV0/X0hIxXaFy65JdkW6c=" -> "dxPqXRyBX75dsO9olsANOK6JI6ikLBT7uBwXu/wsbiw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "g/51v1zdArlQtRg11oxk9kuLg5LXX25BvdOZuCGjBXQ=" -> "SpjdKHzNEA28L2U928MUt/Fa04h/Yap/hGGksUTWFrY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "rvQUmMqhyBPlIVyoYDaLu4YKoa+81AR9sdfAQiUUGII=" -> "/ziyCeTYlv6bNZAcpQhDy1Mk/CFeL+lk+zu0mLY4ARk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "O9w/C8nigSd/KvU+eUfcGYp1RW96eyiV9J3VZSHB8G0=" -> "xj9OShOqbzKujASSyoz8HgqkkKTu5Ry8h3CGXOneqhI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "y8qy26iTY4maHlXOtP2uC+vAIHfSzWMSpRlp/Yl/FZ0=" -> "LyDx2h/AZrS3JGSIheWaRCaS5gLaZm66fCXDAdUQ4j8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "+7RQk09Ld1OwdeP6Sx41zG9wPnp3blLKFW6rW13fD94=" -> "rzCNcP2ytRyMyWYk5+L+hVv+wdTaNjXGTfUPjqHmQGE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "hbaI97J7SwZ3F1oAxQHAkydCNOsceqTGWjyya8tDBzI=" -> "EdwKqwX6ZejwVVzw7OoD0Oe6bj9VNilZaMRd1zjFZGI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "fLa1w7DbEy0DV8A6xS5s/CfIZCBUOPZBm+JXRMch8so=" -> "OyNon818IRIGIRIk1hpxbRRAWNU2oSknldi/T0UTSZ0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "f1BFU6lDakX/t9KxofgTVFKXJ44JzQz79fudbEr0twk=" -> "ar8p7fq5tOqxw4F78H5twvblPWogRB8BwYIhvJjHyFM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "LptOGTlp2yo+TeDeTzxYMjCOifoyIszBqWjw+wfNlvY=" -> "4SIZyoi5dGObB1LwdfpN9apI4zILiw3h4BC9+936Mdc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "wTbNy/cJislrvDDrGkvOCMn7kmvXQKe4gz/ZC9np+2A=" -> "sYT77pgzi9460jE/fse65ubblvbUv1DB3fzAdy0mBTg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "I4kixPMWiYBXzvGDF2iyndwWG1Z4xjAZgFPg+ZDKSb4=" -> "hP28A7zVGGLNWfUaplh0Aq1pbI+kq0HTuoi1kPZYKh0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "IZ3AdwM4GCv34fPNKZmutCZl66mfuPD8h9n73/JNrYw=" -> "OXK/tWYEC1Ccxq9ZRKyxhQMjsSAxOFe5+xyLsRnlgRQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "KwUVEhsR5asJcHnUrYjWtMlS71T7ZPILZpeH8bf/17I=" -> "WocyKpDqMw1c0gvUc2p0e8ziEr7pwlh5+NU82zgksfY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "v23u/BjasWbXWFsbe6GMgfZTPxxnF1phohW5k62rWSs=" -> "zBEkklMyQ+GcqveNpUiBIWwSvTCLWh0IS88H3FRyiw0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "Q3anz468Y1zvkSoFRJkZvW3MRJ7Zq0ycqcp6NgkGhSQ=" -> "X2Z5M2WG/1h52/cS5ay54RzZMheGbNNYkukoTxKtmkE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "SdNV7Jex3TSTjQ0uGLsOfHOLzF6qs27OFRAKqi/3/Bg=" -> "P4HGlYx4VbOichWuX3msd86Izt2amNmvn+dUuJ2NPZo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "da0LjGCf2dHubVQXiIWmVPzC6d/el0zqIhvW/NJ6Xgo=" -> "wLrlukQLOY1RFfINHYcTNvZkiOtYDuFLmTBZ1vnDUik="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "WiwCd7SKsIP/Spc5urB0c8PxWzPGvkuNK7oJemB5yPk=" -> "7qZDRic3+K+bhCumzOGaCfl91FEWBwA3X88NANO3zzI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "4URzcW7IcsfkHvXH9DIl5X2kjUSwraVAWGCDPSfkCj0=" -> "j6PGObuHWKZ+ytrIeUi7lfi9BbtoOMAAYoPzkq+isUk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "MG4JqipdQyi8Yy0qxhPVpD995ZAQ43I9ESShTatKV8E=" -> "pyEf9u3MksDbw4GFmiX+rKDtLhdk3eVGa0OJKk9kIuU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "6Bt4IRY6A75WjxGDs+ejwLoR5PMfVDIoSWhcBs89OwI=" -> "/ypa2A1ANhNGK5DY0mkvLjnOWt+LdmcNnjYTjpnMzaQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "IoojPLlydtJb6kTypZEzBDVHL8VgygComOd0A6NfeLY=" -> "GjekOtbK72lNvupkoawZ/syq91t++v31eQYow7IAZ24="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "1TP/Ao2lorYEvSKWGKW8LGXwMgyG046k0jCgo/Xw6Oc=" -> "QNJprPa66tR5lA+7//358q8KDvX1TQAvJSx+/JGccgU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "k+2xccoXn6njJZccO7526JZWoFQ1B3pj/KZ5D74dWbo=" -> "nnGkZJEXShGe8luyG+88KbFnwaA6uV2vGbzW/Q4i128="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "l05RXpzxMjqFE2BanWDkseuknsxSCL+xkVJ7JWIBGhg=" -> "4G9gW3iWHzJuM2mEnOk+8STu+sHv7BVNyei94m3GhGw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-01-09T18:28:05Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "9e0q7u" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-01-09T18:28:02Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-01-09T18:28:02Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 93 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*